#+TITLE: Life

Life.org keeps tracks of things important in mylife.

***** TODO schedule time to check my eye and get a new lense of my glasses.
:PROPERTIES:
:ID:       58a8febe-ad2b-4a01-bc2e-9c08bb867c4d
:END:
:LOGBOOK:
- State "TODO"       from "WAITING"    [2022-03-03 Thu 03:45]
- State "WAITING"    from "TODO"       [2022-02-26 Sat 16:52] \\
  check my student insurance whether it support or not.
CLOCK: [2022-02-26 Sat 16:50]--[2022-02-26 Sat 16:51] =>  0:01
:END:
[2022-02-26 Sat 16:50]
[[file:~/.doom.d/config.org::*Org Mode][Org Mode]]
***** TODO schedule time to get my teeth check up.
:PROPERTIES:
:ID:       d559d97b-1cdf-4864-a156-7f0e6baa7eac
:END:
:LOGBOOK:
- State "TODO"       from "WAITING"    [2022-03-03 Thu 03:46]
- State "WAITING"    from "TODO"       [2022-02-26 Sat 16:51] \\
  check my student insurance whether it support or not.
CLOCK: [2022-02-26 Sat 16:51]--[2022-02-26 Sat 16:52] =>  0:01
:END:
[2022-02-26 Sat 16:51]
[[file:~/.doom.d/config.org::*Org Mode][Org Mode]]
**** WAITING waiting for 166.96 for electricity from Jared from Jan to March. :WAITING:
:PROPERTIES:
:ID:       fa12a493-be8d-4a63-b446-ed5ca1e745fb
:END:
:LOGBOOK:
- State "WAITING"    from "TODO"       [2022-04-19 Tue 14:57]
CLOCK: [2022-04-19 Tue 14:56]--[2022-04-19 Tue 14:57] =>  0:01
:END:
[2022-04-19 Tue 14:56]
[[file:~/org/life.org::*call At&T and ask them how can I see my history of internet bill of my aprtment][call At&T and ask them how can I see my history of internet bill of my aprtment]]

Total for the apartment from Jan to March: 142.47 + 125.80 + 71.66 = 339.93
***** clean my toilet. :@errand:
:LOGBOOK:
CLOCK: [2022-02-22 Tue 09:49]--[2022-02-22 Tue 09:50] =>  0:01
:END:
[2022-02-22 Tue 09:49]
[[file:/mnt/c/Users/terng/OneDrive/Documents/Working/tgn/evaluation/sliding_window.py::def evaluate_epoch(self, ensemble_idx, epoch, num_batch_pair, checkpoint_loss):]]
**** WAITING waiting for reply to get answer whether cyber training is free for graduate student, [[https://mail.google.com/mail/u/0/#inbox/FMfcgzGpFWJzDRdplNrBKChvZCkMNTdM][here]] :WAITING:
:PROPERTIES:
:ID:       6be1b4b6-23e0-46b2-966e-9e9e60d63f9f
:END:
:LOGBOOK:
- State "WAITING"    from "TODO"       [2022-04-14 Thu 19:19]
CLOCK: [2022-04-14 Thu 19:18]--[2022-04-14 Thu 19:19] =>  0:01
:END:
[2022-04-14 Thu 19:18]
[[file:~/org/life.org::*refactor and clean up scratch page][refactor and clean up scratch page]]

***** TODO figure out what I need to graduate from PhD. who do I talk to? what should I read? where do I get information? should I talk to dr zhu?
:PROPERTIES:
:ID:       6968e2c4-1015-4fd1-a26c-ca5b04faaf91
:END:
:LOGBOOK:
CLOCK: [2022-02-27 Sun 11:27]--[2022-02-27 Sun 11:28] =>  0:01
:END:
[2022-02-27 Sun 11:27]
[[file:~/org/notes/getting-things-done-gtd-note.org::*Horizontal Focus][Horizontal Focus]]
***** TODO read about FAU medical insurance
SCHEDULED: <2022-05-05 Thu>
:PROPERTIES:
:ID:       2cd02b81-41e2-4bf1-9ae9-b516a0aec03e
:END:
:LOGBOOK:
CLOCK: [2022-04-26 Tue 12:14]--[2022-04-26 Tue 12:15] =>  0:01
:END:
[2022-04-26 Tue 12:14]
[[file:~/org/my-resume.org::*Photo & Tagline][Photo & Tagline]]

see [[ https://www.fau.edu/global/international/current/health-insurance/][here]].
***** TODO plan trip to blockchain event during summer.
SCHEDULED: <2022-05-05 Thu>
:PROPERTIES:
:ID:       f8f81629-614e-4e43-9ac4-d5e584b4b514
:END:
:LOGBOOK:
CLOCK: [2022-04-26 Tue 11:34]--[2022-04-26 Tue 11:48] =>  0:14
:END:
[2022-04-26 Tue 11:34]
[[file:~/.doom.d/config.el::add-to-list 'auto-mode-alist '("\\.dat\\'" . ledger-mode)]]
States within USA that have active blockchain community are San Francisco, Tampa, and Miami.
***** TODO set "call back message" if I missed someone called.
SCHEDULED: <2022-05-05 Thu>
:PROPERTIES:
:ID:       53d5ee34-bd30-44a7-92df-d8d665c9be10
:END:
:LOGBOOK:
CLOCK: [2022-04-12 Tue 13:36]--[2022-04-12 Tue 14:16] =>  0:40
CLOCK: [2022-04-12 Tue 13:17]--[2022-04-12 Tue 13:36] =>  0:19
:END:
[2022-04-12 Tue 13:17]
[[file:~/org/PhD.org::*Meeting][Meeting]]
***** TODO contact At&T and figure out what to do.
SCHEDULED: <2022-05-05 Thu>
:PROPERTIES:
:ID:       13533014-cc8a-4f5f-8d6a-c4588a41f483
:END:
:LOGBOOK:
CLOCK: [2022-04-19 Tue 13:54]--[2022-04-19 Tue 13:55] =>  0:01
:END:
[2022-04-19 Tue 13:54]
[[file:~/org/GTD.org::*Refiling + organizing][Refiling + organizing]]
***** setup onedrive for my window. (symlink all my wsl2 content to it. (create a new folder in onedrive base dir named "wsl2." is there a better way?). Once I am done with this. use oneNote todo handwriting stuff + emacs for typing. :emacs:garun:
:LOGBOOK:
CLOCK: [2022-02-27 Sun 00:51]--[2022-02-27 Sun 00:55] =>  0:04
:END:
[2022-02-27 Sun 00:51]
***** Install Info Plus to get the history pesist functionality.
:LOGBOOK:
CLOCK: [2022-02-20 Sun 09:47]--[2022-02-20 Sun 09:49] =>  0:02
:END:
[2022-02-20 Sun 09:47]
***** watch youtube video on how to solve storage problem both on laptop and phone
:PROPERTIES:
:ID:       c942b113-6d8b-46fe-bca4-ff40512d7fc8
:END:
:LOGBOOK:
CLOCK: [2022-04-19 Tue 14:00]--[2022-04-19 Tue 14:01] =>  0:01
:END:
[2022-04-19 Tue 14:00]
[[file:~/org/refile.org::*figure out if I can send mail with ups boxes in FAU.][figure out if I can send mail with ups boxes in FAU.]]
****** TODO read and undersatnd visa and I-20
SCHEDULED: <2022-05-05 Thu>
:PROPERTIES:
:ID:       7007e75b-4259-4d70-8169-572db3964d1d
:END:
:LOGBOOK:
CLOCK: [2022-04-16 Sat 09:49]--[2022-04-16 Sat 09:51] =>  0:02
:END:
[2022-04-16 Sat 09:49]
[[file:~/org/notes/blockchains/blockchain-note.org::*Framework to think about non-fungible token (NFT)?][Framework to think about non-fungible token (NFT)?]]
ask my mom about how visa and passport is issued?  when do I get to renew by visa? I know that with expired visa, I am still legal because of I-94 and I-20. I know that I-94 is about department-arrival information, but what exactly is I-20 used for? how is I-20 related to visa and password?
***** TODO clean my room, clothes, bathroom. fold my clothes. clean dishes
SCHEDULED: <2022-05-05 Thu>
:PROPERTIES:
:ID:       b7372f43-95d8-4502-bf47-861b480ef7b7
:END:
:LOGBOOK:
CLOCK: [2022-05-05 Thu 03:07]--[2022-05-05 Thu 03:25] =>  0:18
:END:
[2022-05-05 Thu 03:07]
[[file:~/org/refile.org::*how much people get paid from writing on mirror.xyz. Can I query data from dune?][how much people get paid from writing on mirror.xyz. Can I query data from dune?]]
*** NEXT 1 hr work on errands tasks :@errand:
SCHEDULED: <2022-04-20 Wed .+1d>
:PROPERTIES:
:STYLE: habit
:REPEAT_TO_STATE: NEXT
:ID:       f59d3ed2-a21f-417c-9b2a-f5424edcdd0f
:LAST_REPEAT: [2022-04-19 Tue 18:42]
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2022-04-19 Tue 18:42]
CLOCK: [2022-04-19 Tue 10:04]--[2022-04-19 Tue 10:05] =>  0:01
- State "DONE"       from "NEXT"       [2022-04-14 Thu 20:03]
- State "DONE"       from "NEXT"       [2022-04-12 Tue 14:14]
- State "DONE"       from "NEXT"       [2022-04-11 Mon 08:17]
- State "DONE"       from "NEXT"       [2022-04-10 Sun 21:25]
:END:
* Getting a job :job:
:PROPERTIES:
:ID:       ec60ddf1-f536-4ed8-aee7-9ff764b8a47a
:END:
:LOGBOOK:
CLOCK: [2022-03-02 Wed 11:28]--[2022-03-02 Wed 12:12] =>  0:44
:END:
**** TODO rewrite my resume from scratch using org mode.
:PROPERTIES:
:ID:       254fef7d-66a7-4578-8ec8-2063062c56d2
:END:
:LOGBOOK:
CLOCK: [2022-03-04 Fri 18:50]--[2022-03-04 Fri 20:00] =>  1:10
CLOCK: [2022-03-04 Fri 02:11]--[2022-03-04 Fri 02:49] =>  0:38
CLOCK: [2022-03-02 Wed 20:54]--[2022-03-02 Wed 21:27] =>  0:33
CLOCK: [2022-03-02 Wed 19:22]--[2022-03-02 Wed 19:30] =>  0:08
:END:
[[https://www.aidanscannell.com/post/org-mode-resume/][Creating a CV/Resume in Org-Mode using LaTeX Template   s]]
look at this guy resume and replicate: https://github.com/HaoZeke/CV/blob/master/RG_Latest-cv.pdf

**** plan out how to utilize linked in to be appeared as better propspect to be employed
:PROPERTIES:
:ID:       8901d2b7-4fe3-4766-b2c9-3a89acf2fbac
:END:
:LOGBOOK:
CLOCK: [2022-02-24 Thu 11:10]--[2022-02-24 Thu 11:12] =>  0:02
:END:
[2022-02-24 Thu 11:10]
[[file:~/org/school.org::*check my exam dates][check my exam dates]]

**** submit my application to layer3
:PROPERTIES:
:ID:       41b0f09a-47bf-4f13-b33a-9d8ba8399063
:END:
:LOGBOOK:
CLOCK: [2022-05-01 Sun 16:46]--[2022-05-01 Sun 16:48] =>  0:02
:END:
[2022-05-01 Sun 16:46]
[[file:~/org/notes/blockchains/decentralized-autonomous-organization-note.org::*Metagovernance][Metagovernance]]
submit application [[https://airtable.com/shrI9EqN4F8oV1NO1][here]].
**** analyse jobs that I want to apply using data analyst technique
:PROPERTIES:
:ID:       dba4bd8d-13b3-4d73-8f07-9b340f3a68a3
:END:
:LOGBOOK:
CLOCK: [2022-04-26 Tue 12:02]--[2022-04-26 Tue 12:03] =>  0:01
:END:
[2022-04-26 Tue 12:02]
[[file:~/org/my-resume.org::*LaTeX Config][LaTeX Config]]
**** TODO how much people get paid from writing on mirror.xyz. Can I query data from dune?
SCHEDULED: <2022-05-05 Thu>
:PROPERTIES:
:ID:       a641437a-c4d0-4bda-abc4-ae74a73d7b7e
:END:
:LOGBOOK:
CLOCK: [2022-05-01 Sun 20:48]--[2022-05-01 Sun 20:49] =>  0:01
:END:
[2022-05-01 Sun 20:48]
